esden/stm32cube-database/db/mcu/memory/STM32_DIE476_3026_2048.xml
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<rzone xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="0.2.0" xs:noNamespaceSchemaLocation="AMC_rzone.xsd">

  <device Dname="STM32U5-Tiger4M" Dvendor="STMicroelectronics:13" info="ARM Cortex-M33, 3026 KB RAM, 2 MB FLASH">
    <package info="STMicroelectronics STM32U5 Series Device Support" name="STM32U5xx_DFP" url="http://www.st.com/" vendor="STMicroelectronics" version="0.0.1-dev1"/>
    <processor Dclock="160000000" Dcore="ARM Cortex-M33" DcoreVersion="r0p0" Ddsp="DSP" Dendian="Little-endian" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" DnumInterrupts="140"  DnumMpuRegions="16" DnumSecMpuRegions="8" DnumSauRegions="8"/>
  </device>

  <resources>

    <sau_init>
      <region start="0x00000000" size="0x10000000" security="n" info="Non-Secure Flash"/>
      <region start="0x20000000" size="0x10000000" security="n" info="Non-Secure RAM"/>
      <region start="0x40000000" size="0x10000000" security="n" info="Non-Secure Peripherals"/>
    </sau_init>

    <memories>
      <memory access="rx" info="Flash memory" name="Flash_NS" security="n" size="0x00200000" start="0x08000000" type="ROM"/>
      <memory access="rwx" info="SRAM Code" name="RAM_C_NS" physical="0x20000000" security="n" size="0x002F0000" start="0x0A000000" type="RAM"/>

      <memory access="rx" info="Flash memory" name="Flash_S" physical="0x08000000" security="c" size="0x00200000" start="0x0C000000" type="ROM"/>
      <memory access="rwx" info="SRAM Code" name="RAM_C_S" physical="0x20000000" security="c" size="0x002F0000" start="0x0E000000" type="RAM"/>

      <memory access="rwx" info="SRAM" name="SRAM_NS" security="n" size="0x002F0000" start="0x20000000" type="RAM"/>
      <memory access="rwx" info="SRAM Smart Run Domain" name="SRAM_SRD_NS" security="n" size="0x00004000" start="0x28000000" type="RAM"/>

      <memory access="rwx" info="SRAM" name="SRAM_S" physical="0x20000000" security="c" size="0x002F0000" start="0x30000000" type="RAM"/>
      <memory access="rwx" info="SRAM Smart Run Domain" name="SRAM_SRD_S" physical="0x28000000" security="c" size="0x00004000" start="0x38000000" type="RAM"/>

      <memory access="rw" info="Backup SRAM" name="BKPSRAM_NS" security="n" size="0x00000800" start="0x40036400" type="RAM"/>
      <memory access="rw" info="Backup SRAM" name="BKPSRAM_S" physical="0x40036400" security="c" size="0x00000800" start="0x50036400" type="RAM"/>

      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM1" name="GTZC1_MPCBB1" size="0x000C0000" start="0x20000000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM2" name="GTZC1_MPCBB2" size="0x00010000" start="0x200C0000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM3" name="GTZC1_MPCBB3" size="0x000D0000" start="0x200D0000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM5" name="GTZC1_MPCBB5" size="0x000D0000" start="0x201A0000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM6" name="GTZC1_MPCBB6" size="0x00080000" start="0x20270000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM4" name="GTZC1_MPCBB4" size="0x00004000" start="0x28000000" type="sp"/>

      <mpc blk_size="0x2000" info="Flash Bank1" name="FLASH_BB1" size="0x00200000" start="0x08000000" type="sp"/>

      <mpcwm sections="2" granularity="0x00020000" info="OctoSPI1" name="GTZC1_MPCWM1" size="0x10000000" start="0x90000000" type="sp"/>
      <mpcwm sections="2" granularity="0x00020000" info="FMC Bank1" name="GTZC1_MPCWM2" size="0x10000000" start="0x60000000" type="sp"/>
      <mpcwm sections="1" granularity="0x00020000" info="FMC Bank3" name="GTZC1_MPCWM3" size="0x10000000" start="0x80000000" type="sp"/>
      <mpcwm sections="1" granularity="0x00000020" info="Backup SRAM" name="GTZC1_MPCWM4" size="0x00000800" start="0x40036400" type="sp"/>
      <mpcwm sections="2" granularity="0x00020000" info="OctoSPI2" name="GTZC1_MPCWM5" size="0x10000000" start="0x70000000" type="sp"/>
      <mpcwm sections="2" granularity="0x00020000" info="HSPI1" name="GTZC1_MPCWM6" size="0x10000000" start="0xA0000000" type="sp"/>

      <mpcwm sections="1" granularity="0x00002000" info="Flash Bank1" name="FLASH_WM1" size="0x00200000" start="0x08000000" type="s"/>
    </memories>

   </resources>

</rzone>
